apps/test-suite/load-test-fe.yml
config:
  processor: "load-test-functions.js"
  payload:
    path: "webpages.csv"
    fields:
      - "url"
  target: # FIRE_ENGINE_URL
  http:
    timeout: 30
  phases:
  # /scrape
    # - duration: 60
    #   arrivalRate: 10  # Initial load
    # - duration: 120
    #   arrivalRate: 20  # Increased load
    # - duration: 180
    #   arrivalRate: 30  # Peak load
    - duration: 60
      arrivalRate: 1  # Cool down
    # - duration: 300
    #   arrivalRate: 1
    #   rampTo: 20
    #   name: ramp up
  # /crawl
    # - duration: 10
    #   arrivalRate: 1  # Initial load
    # - duration: 120
    #   arrivalRate: 2  # Increased load
    # - duration: 180
    #   arrivalRate: 3  # Peak load
    # - duration: 60
    #   arrivalRate: 1  # Cool down
  defaults:
    headers:
      Authorization: "Bearer YOUR_API_KEY"
scenarios:
  - name: Scrape a URL
    flow:
      - post:
          url: "/scrape"
          json:
            url: "{{ url }}"
            engine: "chrome-cdp"
          capture:
            - json: "$.content"
              as: content
          validate:
            statusCode: 200
          afterResponse: "removeFailedURL"

  # - name: Crawl a URL
  #   flow:
  #     - post:
  #         url: "/crawl"
  #         json:
  #           url: "https://rsseau.fr"
  #           crawlerOptions:
  #             limit: 100
  #           pageOptions:
  #             onlyMainContent: true
  #         capture:
  #           - json: "$.id"
  #             as: id
  #     - think: 10
  #     - get:
  #         url: "/crawl/{{ job_id }}"
  #         capture:
  #           - json: "$.status"
  #             as: crawl_status
  #         until: 
  #           - condition: "equals"
  #             value: "completed"
  #             variable: "crawl_status"
  #         retry:
  #           count: 20
  #           wait: 10